In [5]:
import pandas as pd
data = { 'name' : ['AA', 'IBM', 'GOOG'],
'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],
'shares' : [100, 30, 90],
'price' : [12.3, 10.3, 32.2]
}
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [6]:
df

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [7]:
df['owner']='Unknown'
df

   name        date  shares  price    owner
0    AA  2001-12-01     100   12.3  Unknown
1   IBM  2012-02-10      30   10.3  Unknown
2  GOOG  2010-04-09      90   32.2  Unknown

In [8]:
df.index = ['one', 'two', 'three']

In [9]:
df

       name        date  shares  price    owner
one      AA  2001-12-01     100   12.3  Unknown
two     IBM  2012-02-10      30   10.3  Unknown
three  GOOG  2010-04-09      90   32.2  Unknown

In [10]:
df = df.set_index(['name'])
df

            date  shares  price    owner
name
AA    2001-12-01     100   12.3  Unknown
IBM   2012-02-10      30   10.3  Unknown
GOOG  2010-04-09      90   32.2  Unknown

In [11]:
#access data using column-index
df['shares']

name
AA      100
IBM      30
GOOG     90
Name: shares, dtype: int64

In [12]:
#access data by row-index
df.ix['AA']

C:\Users\Vasquez\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

date      2001-12-01
shares           100
price           12.3
owner        Unknown
Name: AA, dtype: object

In [14]:
df.loc['GOOG']

date      2010-04-09
shares            90
price           32.2
owner        Unknown
Name: GOOG, dtype: object

In [20]:
#then .ix is deprecate so i need to use .loc or .iloc
#in the same way that we use to .ix.
df

            date  shares  price    owner
name
AA    2001-12-01     100   12.3  Unknown
IBM   2012-02-10      30   10.3  Unknown
GOOG  2010-04-09      90   32.2  Unknown

In [21]:
df.loc[:, 'price']

name
AA      12.3
IBM     10.3
GOOG    32.2
Name: price, dtype: float64

In [25]:
df.loc['AA', 'price']

12.3

In [26]:
df.iloc[0]

date      2001-12-01
shares           100
price           12.3
owner        Unknown
Name: AA, dtype: object

In [31]:
df.iloc[:, 0]

name
AA      2001-12-01
IBM     2012-02-10
GOOG    2010-04-09
Name: date, dtype: object

In [32]:
df.iloc[0,0]

'2001-12-01'

In [33]:
del df['owner']

In [34]:
df

            date  shares  price
name
AA    2001-12-01     100   12.3
IBM   2012-02-10      30   10.3
GOOG  2010-04-09      90   32.2

In [35]:
df['owner']='Unknowkn'

In [36]:
df

            date  shares  price     owner
name
AA    2001-12-01     100   12.3  Unknowkn
IBM   2012-02-10      30   10.3  Unknowkn
GOOG  2010-04-09      90   32.2  Unknowkn

In [40]:
df.drop(['owner', 'date'], axis=1)

      shares  price
name
AA       100   12.3
IBM       30   10.3
GOOG      90   32.2

In [54]:
df.drop(columns=['shares', 'price'])

            date    owner
name
AA    2001-12-01  Unknown
IBM   2012-02-10  Unknown
GOOG  2010-04-09  Unknown

In [57]:
#drop a row by index
df.drop(['AA'])

            date  shares  price    owner
name
IBM   2012-02-10      30   10.3  Unknown
GOOG  2010-04-09      90   32.2  Unknown